IDENTIFICATION DIVISION.
PROGRAM-ID. test-program.
ENVIRONMENT DIVISION.
DATA DIVISION.
WORKING-STORAGE SECTION.
01	varx.

PROCEDURE DIVISION.
    DISPLAY "This is a cobol program".
    DISPLAY varx.
    
    